import json
import re
aspects=[]
with open('yandex_aspects.json', 'r') as file:
    d = json.load(file)
    for court in d:
        for asp in range(len(d[court])):
            for word in d[court][asp]:
                aspects += [re.sub(r'[^a-zA-Zа-яА-ЯёЁ]\ ', '',word.lower())]
with open('google_aspects.json', 'r') as file:
    d = json.load(file)
    for court in d:
        for asp in range(0, len(d[court])):
            for word in d[court][asp]:
                aspects += [re.sub(r'[^a-zA-Zа-яА-ЯёЁ]\ ', '',word.lower())]

themes = {
    'Контакты': ['адрес','сеть','вайфай','телеф', 'номер', 'звон', 'сайт', 'трубк', 'званк', 'почт',"связ","письм",'ответ','оповещ','повест'],
    'Расположение': ['доступ','располож', 'территория', 'метро', 'парк', 'порков', 'стоянк', 'езд', 'пандус', 'шлагба', 'ворот'],
    'Судья': ['судь', 'судей'],
    'Сотрудники': ['обращ','девочк', 'женщин', 'девушк', 'специал', 'работн', 'сторож', 'вахт', 'прокурор', 'коллектив', 'исполн', 'сикрет', 'секретар', 'помощни', 'работн', 'персонал', 'охран', 'пристав', 'канцел', 'сотр', 'начал'],
    'Функционирование суда': ["турникет","пропуск","wifi",'процесс', 'интерн', 'задерж', 'ожидан', 'очеред', 'отношен', 'логист', 'обслуж', 'корруп', 'работ', 'прием', 'приём', 'судебн', 'аппар', 'дел', 'докумен', 'правосу'],
    'Суд': ['участк', 'организация', 'атмосфера', 'обстанов', 'участок', 'заведение', 'филиал', 'суд', 'здан', 'контор', 'кантор', 'учрежд'],
    'Строение': ['санузел','внутри', 'ремонт', 'туалет', 'гардероб', 'вестиб', 'архитект', 'сооруж', 'коридор', 'лифт', 'прихож', 'мест', 'зал', 'помещ', 'комнат', 'кабинет', 'приёмн', 'приемн'],
    'Заседание': ['засед', 'рассмотр', 'решен', 'приговор',"слушан"],
    'Буфет': ['столов', ' еда', ' каф', 'буфет'," блюд"],
    'Другое':[]
}

def check_theme(aspect):
    for theme in themes:
        for i in themes[theme]:
            if i in aspect:
                return theme
    return 'Другое'


aspects=sorted(list(set(aspects)))
print(len(aspects))

with open("catogories_aspects.json","w", encoding="utf-8") as file:
    result={}
    for key in themes.keys():
        result[key]=[]
    for i in aspects:
        result[check_theme(i)]+=[i]
    json.dump(result, file, ensure_ascii=False)
